from random import random

# Генерация списка
list_price = [round(random() * 100, 2) for i in range(10)]
print(list_price, id(list_price), '<- адрес')

# Печать цен через запятую
is_first = True
for cost in list_price:
    if not is_first:
        print(end=', ')
    is_first = False
    print(f'{int(cost)} руб {int(round(cost - int(cost), 2) * 100):02d} коп', end='')
print('\n')

# Сортировка по возрастанию методом in place
list_price.sort()
print(list_price, id(list_price), '<- адрес остался тот же')
print('')

# Сортировка по убыванию (новый список)
list_price_reversed = list_price[::-1]
print(list_price_reversed, id(list_price_reversed), '<- адрес изменился, значит список новый')
print('')

# Вывод пяти самых дорогих товаров
print(list_price_reversed[:5][::-1], '<- список пяти самых дорогих товаров (по возрастанию)')

"""
5. Создать список, содержащий цены на товары (10–20 товаров), например:
[57.8, 46.51, 97, ...]
Вывести на экран эти цены через запятую в одну строку, цена должна отображаться в виде <r> руб <kk> коп (например «5 руб 04 коп»). Подумать, как из цены получить рубли и копейки, как добавить нули, если, например, получилось 7 копеек или 0 копеек (должно быть 07 коп или 00 коп).
Вывести цены, отсортированные по возрастанию, новый список не создавать (доказать, что объект списка после сортировки остался тот же).
Создать новый список, содержащий те же цены, но отсортированные по убыванию.
Вывести цены пяти самых дорогих товаров. Сможете ли вывести цены этих товаров по возрастанию, написав минимум кода?
"""