"""
Склонение слова
Реализовать склонение слова «процент» во фразе «N процентов». Вывести эту фразу на экран отдельной строкой для каждого из чисел в интервале от 1 до 100:
1 процент
2 процента
3 процента
4 процента
5 процентов
6 процентов
...
100 процентов
"""

for i in range(1, 101):
    if 10 < i < 15:
        word_declension = 'процентов'
    elif i % 10 == 1:
        word_declension = 'процент'
    elif 1 < i % 10 < 5:
        word_declension = 'процента'
    else:
        word_declension = 'процентов'
    print(i, word_declension)
